#создадим базу данных товаров
import random
import json

tov_base = {};
tov_list =["Курятина Фієста в’ялена, ТМ Oбjerky, 25 г",
               "Наггетси ОбДжерки Яловичина Техаська в'ялена, 50 г",
               "Свинина Октоберфест в'ялена, ТМ Обjerky, 50г.",
               "Яловичина Техаська в`ялена, ТМ Обjerky, 25 г.",
               "Яловичина Техаська в`ялена, ТМ Обjerky, 50 г.",
               "Яловичина Чилі в`ялена, ТМ Обjerky, 50 г.",
               "Креветкові чипси з Вершково-часниковим смаком, 50",
               "Креветкові чипси зі смаком соусу Теріякі, 50 г",
               "Креветкові чипси зі смаком Том-Ям, 50 г",
               "Креветочні чіпси зі смаком Сиру, 50 г",
               "Креветочні чіпси Класичні, 50 г",
               "Шкварки З Розмарином та ароматом трюфеля, 50 гр",
               "Шкварки Оригінал, 50 гр",
               "Шкварки Солодкий Чілі та Барбекю, 50 гр",
               "Чiпси кокосовi з апельсином, 30 гр",
               "Чiпси кокосовi з ванiллю, 15 гр"
               "Чiпси кокосовi з ванiллю, 30 гр",
               "Чiпси кокосовi з манго, 30 гр",
               "Чіпси кокосові з сиром пармезан, 30 гр",
               "Чіпси кокосові нейтральні, 30 гр"];

for ntov in range(len(tov_list)):
    tov_id = ntov+1;
    tov_name = tov_list[ntov];
    tov_cena = float(random.randint(1, 1000));
    #теперь обьединим это все удовольствие в список
    tov_base[tov_id] = dict(tov_name=tov_name, tov_cena=tov_cena);
print(tov_base);
print(f"len(tov_base) = {len(tov_base)}");
#теперь засунем эту базу штуку в файл
json.dump(tov_base, open("tov_base.json", "w"), indent=2);



